Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Methods
The ProfileCatalog type exposes the following members.
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
ProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace